---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimLabelGpShow
source: html/e0b23f94-a613-ce06-14a6-a0bd647ed415.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimLabelGpShow Property

"Show Label in View"

## Syntax (C#)
```csharp
public static ForgeTypeId DimLabelGpShow { get; }
```